//DBGHCIP JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M,COND=(16,LT)
//* Action: Debug Test Case...
//* Source: IBMUSER.GIT.ZMOBILE.LOAD(THCIPDB0)
//        SET FELJOB=ZUNITDB
//RUNNER EXEC PROC=BZUPPLAY,
// BZUCFG=IBMUSER.ZUNIT.BZUCFG(THCIPDB0),
// BZUCBK=IBMUSER.GIT.ZMOBILE.LOAD,
// BZULOD=IBMUSER.GIT.ZMOBILE.LOAD,
//  PRM='STOP=E,REPORT=XML'
//REPLAY.CEEOPTS DD *
TEST(ALL,,PROMPT,DBMDT%IBMUSER:*)
/*
//REPLAY.BZUPLAY DD DISP=SHR,
// DSN=IBMUSER.ZUNIT.PB.HCIPDB01
//REPLAY.BZURPT DD DISP=SHR,
// DSN=IBMUSER.ZUNIT.BZURES(THCIPDB0)
//STEPLIB DD
//        DD DSN=IBMUSER.LOAD,DISP=SHR
//        DD DSN=IBMUSER.GIT.ZMOBILE.LOAD,DISP=SHR