//HCAZPLAY  JOB ,NOTIFY=&SYSUID,REGION=0M
//*  Run WAZI VTP for HCAZ
//PLAYBK   EXEC PGM=BZUPLAY,PARM='TRACE=Y'
//STEPLIB  DD DISP=SHR,DSN=BZU100.SBZULOAD
//         DD DISP=SHR,DSN=JENKINS.HEALTH.LOAD
//BZUPLAY  DD DISP=SHR,DSN=BZU100.ZUNIT.PLAYBACK.BAK
//*BZUPLAY  DD DISP=SHR,DSN=BZU100.ZUNIT.PLAYBACK
//*BZUPLAY  DD DISP=SHR,DSN=BZU100.VTP.HCAZ.PLAYBACK
//SYSOUT   DD SYSOUT=*       (this keeps LE output in one spool file)
//BZUMSG  DD SYSOUT=*        (optional, can be a VB output dataset)
//