//ZUDB01 JOB ,                                                        JOB00154
// MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M,COND=(16,LT)
//* Action: Run Test Case...
//* Source: IBMUSER.GIT.ZMOBILE.LOAD(THCIPDB0)
//        SET FELJOB=ZUNITGO
//RUNNER EXEC PROC=BZUPPLAY,
// BZUCFG=IBMUSER.ZUNIT.BZUCFG(THCIPDB0),
// BZUCBK=IBMUSER.GIT.ZMOBILE.LOAD,
// BZULOD=IBMUSER.GIT.ZMOBILE.LOAD,
//  PRM='STOP=E,REPORT=XML'
//REPLAY.BZUPLAY DD DISP=SHR,
// DSN=IBMUSER.ZUNIT.PB.HCIPDB01
//REPLAY.BZURPT DD DISP=SHR,
// DSN=IBMUSER.ZUNIT.BZURES(THCIPDB0)
//STEPLIB  DD
//         DD
//         DD
//         DD DISP=SHR,DSN=IBMUSER.LOAD  * Delay dbg see EQAOPTS.jcl
//         DD DISP=SHR,DSN=IBMUSER.V14R2.SEQAMOD  New Debugger
//         DD DISP=SHR,DSN=&EQA..SEQAMOD       Debugger
//         DD DISP=SHR,DSN=IBMUSER.GIT.ZMOBILE.LOAD     the program