       PROCESS NODLL,NODYNAM,TEST(NOSEP),NOCICS,NOSQL,PGMN(LU)
      *+---------------------------------------------------------------+
      *| THCMADB0                                                      |
      *| PRODUCT: IBM DEVELOPER FOR Z/OS                               |
      *| COMPONENT: IBM Z/OS AUTOMATED UNIT TESTING FRAMEWORK (ZUNIT)  |
      *|   FOR ENTERPRISE COBOL AND PL/I                               |
      *| PROGRAM: ENTERPRISE COBOL ZUNIT TEST CASE FOR DYNAMIC RUNNER  |
      *| DATE GENERATED: 10/23/2020 10:12                              |
      *| ID: 1287988d-02c7-4393-b230-9fe7c7244205                      |
      *+---------------------------------------------------------------+
      *+---------------------------------------------------------------+
      *| TEST_TEST2                                                    |
      *|     THIS PROGRAM IS FOR TEST TEST2                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST2'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'HCMADB02'.
       01 BZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM TEST CALLBACK'.
       01  BZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  BZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  BZ-P3 PIC X(3) VALUE 'AZU'.
       01 BZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000000.
            5 PIC X(6) DISPLAY VALUE '01AMED'.
          3 ZUT00000001.
            5 PIC X(7) DISPLAY VALUE 'COVID01'.
            5 PIC X(3) DISPLAY VALUE SPACES.
          3 ZUT00000002.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT00000003.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT00000004.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT00000005.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT00000006.
            5 PIC X(10) VALUE X'F2F1D4C7404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040F040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040F2F0F2F060'.
            5 PIC X(10) VALUE X'F0F160F2F1F2F0F2F060'.
            5 PIC X(10) VALUE X'F0F260F2F2F0F0F0F1F0'.
            5 PIC X(10) VALUE X'F0F0F7F0F50000000000'.
            5 PIC X(10) VALUE X'00000000007800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000012C040000'.
            5 PIC X(10) VALUE X'00000000004000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000008000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000021C3186000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00010000800000000000'.
            5 PIC X(10) VALUE X'21C31808000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000021C31548'.
            5 PIC X(10) VALUE X'00000000000000004D00'.
            5 PIC X(10) VALUE X'0000072C12BD00000001'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'16CC0000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000A2406FDC00000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000000001A'.
            5 PIC X(10) VALUE X'00000009000000000000'.
            5 PIC X(10) VALUE X'00170000000900000078'.
            5 PIC X(10) VALUE X'0000000500000000FFFF'.
            5 PIC X(10) VALUE X'FFFF21C2478821C2FBB8'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000021C2F59400000000'.
            5 PIC X(10) VALUE X'21C2F5980000000021C2'.
            5 PIC X(10) VALUE X'F59C0000000021C2F5A0'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000021C2F99000000000'.
            5 PIC X(10) VALUE X'21C2F9A00000000021C2'.
            5 PIC X(10) VALUE X'F9B00000000021C2F9B8'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000021C2B23800000000'.
            5 PIC X(10) VALUE X'222C4C520000000021C2'.
            5 PIC X(10) VALUE X'FB640000000021C2FB68'.
            5 PIC X(10) VALUE X'000000002089A4880000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000056870'.
            5 PIC X(10) VALUE X'21C23B882243E3100000'.
            5 PIC X(10) VALUE X'000000C3D7C9C8000080'.
            5 PIC X(10) VALUE X'926C00D8C3C5E2C900D8'.
            5 PIC X(10) VALUE X'C3C5E2D600D8C3C5E2C5'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000E4F0F0F0F0F0F5F8'.
            5 PIC X(10) VALUE X'E4F0F0F0F0F0F5F8C8C1'.
            5 PIC X(10) VALUE X'D5C321C2791021C27910'.
            5 PIC X(10) VALUE X'21C2791021C3002821C3'.
            5 PIC X(10) VALUE X'0DE800000FF000000230'.
            5 PIC X(10) VALUE X'21C3002800000DA0D3C5'.
            5 PIC X(10) VALUE X'C3C10000000022163BD0'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000047F0F0D014CE'.
            5 PIC X(10) VALUE X'B00021C300FC00000000'.
            5 PIC X(10) VALUE X'000000F0000E7C7CC6C5'.
            5 PIC X(10) VALUE X'C3C24040404040404040'.
            5 PIC X(10) VALUE X'03000000223F79C80000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C2'.
            5 PIC X(10) VALUE X'BDC8000000F000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00008000000021C300D8'.
            5 PIC X(10) VALUE X'40404040404040400000'.
            5 PIC X(10) VALUE X'00000000000021C300D8'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00005080D0345880F0E0'.
            5 PIC X(10) VALUE X'07F8000000000000222C'.
            5 PIC X(10) VALUE X'DB680000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000002089A488'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000005'.
            5 PIC X(10) VALUE X'687021C23B882243E310'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000000222C'.
            5 PIC X(10) VALUE X'45CC222C45D0222C45D0'.
            5 PIC X(10) VALUE X'222C45D0222C45D0222C'.
            5 PIC X(10) VALUE X'45D0222C45D0222C45D0'.
            5 PIC X(10) VALUE X'222C45D0222C45D0FFFF'.
            5 PIC X(10) VALUE X'FFFFFFFFFFFF222C45D0'.
            5 PIC X(10) VALUE X'222C45D0222C45D0222C'.
            5 PIC X(10) VALUE X'45D0FFFFFFFFFFFF0000'.
            5 PIC X(10) VALUE X'222C4560E0BDADD0C05F'.
            5 PIC X(10) VALUE X'A15A7B4F5B7C79000000'.
            5 PIC X(10) VALUE X'21C2B808C1C6C3C20000'.
            5 PIC X(10) VALUE X'000021C30760AFCBAFCB'.
            5 PIC X(10) VALUE X'01000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'083021C3085000000000'.
            5 PIC X(10) VALUE X'21C3092C000000000000'.
            5 PIC X(10) VALUE X'00440000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000FFFFFFFF0000'.
            5 PIC X(10) VALUE X'000021C3089C21C3089C'.
            5 PIC X(10) VALUE X'22296790222966982229'.
            5 PIC X(10) VALUE X'6528222965D822296418'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000002229'.
            5 PIC X(10) VALUE X'63402229626800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C23AF858FF000807FF'.
            5 PIC X(10) VALUE X'000022296B0800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000058FF0008'.
            5 PIC X(10) VALUE X'07FF0000222968F80000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000004DE2E3'.
            5 PIC X(10) VALUE X'C4D6E4E35D5D00000000'.
            5 PIC X(10) VALUE X'00000000008500000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000040000'.
            5 PIC X(10) VALUE X'221B1C68C1C6C3C20000'.
            5 PIC X(10) VALUE X'000021C30990AFCBAFCB'.
            5 PIC X(10) VALUE X'01000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'0A6021C30A8000000000'.
            5 PIC X(10) VALUE X'21C30B5C000000000000'.
            5 PIC X(10) VALUE X'00440000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000FFFFFFFF0000'.
            5 PIC X(10) VALUE X'000021C30ACC21C30ACC'.
            5 PIC X(10) VALUE X'22296790222966982229'.
            5 PIC X(10) VALUE X'6528222965D822296418'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000002229'.
            5 PIC X(10) VALUE X'63402229626800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C23AF858FF000807FF'.
            5 PIC X(10) VALUE X'000022296B0800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000058FF0008'.
            5 PIC X(10) VALUE X'07FF0000222968F80000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000004DE2E3'.
            5 PIC X(10) VALUE X'C4C5D9D95D5D00000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000C1C6C3C20000'.
            5 PIC X(10) VALUE X'000021C30BC0AFCBAFCB'.
            5 PIC X(10) VALUE X'01000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'0C9021C30CB000000000'.
            5 PIC X(10) VALUE X'21C30D8C000000000000'.
            5 PIC X(10) VALUE X'00440000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000FFFFFFFF0000'.
            5 PIC X(10) VALUE X'000021C30CFC21C30CFC'.
            5 PIC X(10) VALUE X'22296790222966982229'.
            5 PIC X(10) VALUE X'6528222965D822296418'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000002229'.
            5 PIC X(10) VALUE X'63402229626800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C23AF858FF000807FF'.
            5 PIC X(10) VALUE X'000022296B0800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000058FF0008'.
            5 PIC X(10) VALUE X'07FF0000222968F80000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000007900'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000004DE2E3'.
            5 PIC X(10) VALUE X'C4C9D55D5D0000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'22296340222962680000'.
            5 PIC X(10) VALUE X'0000F2F0F2F0F1F0F2F3'.
            5 PIC X(10) VALUE X'F0F8F0F9F2F700000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000022296B080000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000058FF'.
            5 PIC X(10) VALUE X'000807FF0000222968F8'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000000004D'.
            5 PIC X(10) VALUE X'E2E3C4D6E4E35D5D0000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000C1C6C3C2'.
            5 PIC X(10) VALUE X'0000000021C30F50AFCB'.
            5 PIC X(10) VALUE X'AFCB0100000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C3102021C310400000'.
            5 PIC X(10) VALUE X'000021C3111C00000000'.
            5 PIC X(10) VALUE X'00000044000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000FFFFFFFF'.
            5 PIC X(10) VALUE X'0000000021C3108C21C3'.
            5 PIC X(10) VALUE X'108C2229679022296698'.
            5 PIC X(10) VALUE X'22296528222965D82229'.
            5 PIC X(10) VALUE X'64180000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'22296340222962680000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000000E4F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F5F8E4F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F5F8000000010000'.
            5 PIC X(10) VALUE X'000221ADA15000000000'.
            5 PIC X(10) VALUE X'F1F100000000000058FF'.
            5 PIC X(10) VALUE X'000807FF0000E4F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F5F8E4F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F5F8F24BF20000000000'.
            5 PIC X(10) VALUE X'998583E2A38199A30000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000001C8C3D4C1C4C2'.
            5 PIC X(10) VALUE X'F0F20000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000000E4F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F5F8E4F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F5F8E2E3D2E421C2'.
            5 PIC X(10) VALUE X'A3BC21C2A3BC00000FF0'.
            5 PIC X(10) VALUE X'00000080000000000808'.
            5 PIC X(10) VALUE X'000021C2AF9821C31160'.
            5 PIC X(10) VALUE X'8074C1DC223D99B00000'.
            5 PIC X(10) VALUE X'000021C2B03021C2AF80'.
            5 PIC X(10) VALUE X'223D99A20000000021C2'.
            5 PIC X(10) VALUE X'74ECA200000021C2A930'.
            5 PIC X(10) VALUE X'0000000021C2A8F821EF'.
            5 PIC X(10) VALUE X'E93F21EFD94000000000'.
            5 PIC X(10) VALUE X'0000000021C3116021C2'.
            5 PIC X(10) VALUE X'B25821C2B03800000000'.
            5 PIC X(10) VALUE X'0000000000000000A1C2'.
            5 PIC X(10) VALUE X'9B48000000002089A488'.
            5 PIC X(10) VALUE X'00000000000000002243'.
            5 PIC X(10) VALUE X'F0D0A1C335A81000C3C2'.
            5 PIC X(10) VALUE X'21C310E021C31180A23D'.
            5 PIC X(10) VALUE X'9F5C223DBD700000001B'.
            5 PIC X(10) VALUE X'21C311F821C2B030223D'.
            5 PIC X(10) VALUE X'AFDE0000000000000000'.
            5 PIC X(10) VALUE X'222B34B521C30DE421C3'.
            5 PIC X(10) VALUE X'121E21C30DE600000002'.
            5 PIC X(10) VALUE X'21C3121C21C29B480000'.
            5 PIC X(10) VALUE X'000021C3163800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000FFFFFFFF'.
            5 PIC X(10) VALUE X'0000000021C312BC21C3'.
            5 PIC X(10) VALUE X'12BC2229679022296698'.
            5 PIC X(10) VALUE X'2229652821C2B3D421C2'.
            5 PIC X(10) VALUE X'B3D82236CD0421C2B3D0'.
            5 PIC X(10) VALUE X'21C2B3DC000000000000'.
            5 PIC X(10) VALUE X'001B0000000221C3121C'.
            5 PIC X(10) VALUE X'00000000A1C2B3E00000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000014F2F700F00000'.
            5 PIC X(10) VALUE X'0000000000F2F2F70000'.
            5 PIC X(10) VALUE X'21C31160000000000000'.
            5 PIC X(10) VALUE X'00000000000000000003'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000021C3121021C31227'.
            5 PIC X(10) VALUE X'0000000022296B080000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000121C2B4C0222968F8'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000003'.
            5 PIC X(10) VALUE X'00000001000000004084'.
            5 PIC X(10) VALUE X'08000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000001'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C2'.
            5 PIC X(10) VALUE X'A31821C2A31C00000008'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000021C2B214'.
            5 PIC X(10) VALUE X'0000000000000000004D'.
            5 PIC X(10) VALUE X'E2E3C4C9D55D5D000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C2B3B0229CA99921C2'.
            5 PIC X(10) VALUE X'B3C80000000100000000'.
            5 PIC X(10) VALUE X'21C2DFA0FFFFFFFC0000'.
            5 PIC X(10) VALUE X'00040000000000000000'.
            5 PIC X(10) VALUE X'00000000F2F0F2F0F1F0'.
            5 PIC X(10) VALUE X'F2F310F8F0F921C31160'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'15100000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00F2F2F4000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000300000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'145021C3146700000000'.
            5 PIC X(10) VALUE X'40404040C3C5E2C50000'.
            5 PIC X(10) VALUE X'001700000012000000DF'.
            5 PIC X(10) VALUE X'0000000D000000DD0000'.
            5 PIC X(10) VALUE X'0000000000000001F040'.
            5 PIC X(10) VALUE X'00C50000000000000000'.
            5 PIC X(10) VALUE X'00000000000000056870'.
            5 PIC X(10) VALUE X'21C23B882243E3100000'.
            5 PIC X(10) VALUE X'000000C3D7C9C8000080'.
            5 PIC X(10) VALUE X'926C00D8C3C5E2C900D8'.
            5 PIC X(10) VALUE X'C3C5E2D600D8C3C5E2C5'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000E4F0F0F0F0F0F5F6'.
            5 PIC X(10) VALUE X'E4F0F0F0F0F0F5F6C8C1'.
            5 PIC X(10) VALUE X'D5C321C28E0021C28E00'.
            5 PIC X(10) VALUE X'21C28E0021C3151821C3'.
            5 PIC X(10) VALUE X'22D800000FF000000230'.
            5 PIC X(10) VALUE X'21C3151800000DA0D3C5'.
            5 PIC X(10) VALUE X'C3C10000000022163BD0'.
            5 PIC X(10) VALUE X'000000000000007E0000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'E4F0F0F0F0F0F5F7E4F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F5F700000001'.
            5 PIC X(10) VALUE X'0000000221ADA1500000'.
            5 PIC X(10) VALUE X'0000F1F1000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'0DD800000000223DC4A8'.
            5 PIC X(10) VALUE X'223DC4B8223DC4C1223D'.
            5 PIC X(10) VALUE X'C658223DC65E9985C689'.
            5 PIC X(10) VALUE X'222B34B4000000000000'.
            5 PIC X(10) VALUE X'00000000000110000000'.
            5 PIC X(10) VALUE X'21C31160000000000000'.
            5 PIC X(10) VALUE X'00000000000000000002'.
            5 PIC X(10) VALUE X'C4C6C8D7C9D1D760F0F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F0F100000000'.
            5 PIC X(10) VALUE X'00000000E4F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F5F7E4F0F0F0F0F0F5F7'.
            5 PIC X(10) VALUE X'E2E3D2E421C2A97C0000'.
            5 PIC X(10) VALUE X'000021C3194000000080'.
            5 PIC X(10) VALUE X'000000000808000021C2'.
            5 PIC X(10) VALUE X'B55821C317108074C1DC'.
            5 PIC X(10) VALUE X'223D99B00000000021C2'.
            5 PIC X(10) VALUE X'B5F021C2B540223D99A2'.
            5 PIC X(10) VALUE X'0000000021C27AACA200'.
            5 PIC X(10) VALUE X'000021C2AEF000000000'.
            5 PIC X(10) VALUE X'21C2AEB821EFE93F21EF'.
            5 PIC X(10) VALUE X'D9400000000000000000'.
            5 PIC X(10) VALUE X'21C3171021C2B8180000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000A1C2A1080000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00001000000021C31690'.
            5 PIC X(10) VALUE X'00000000A23D9F5C223D'.
            5 PIC X(10) VALUE X'BD700000001A21C317A8'.
            5 PIC X(10) VALUE X'21C2B5F0223DAFDE0000'.
            5 PIC X(10) VALUE X'000000000000222B34B5'.
            5 PIC X(10) VALUE X'21C313A421C317CE21C3'.
            5 PIC X(10) VALUE X'13A60000000221C317CC'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'1BE80000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C2B99421C2B9982236'.
            5 PIC X(10) VALUE X'CD0421C2B99021C2B99C'.
            5 PIC X(10) VALUE X'000000000000001A0000'.
            5 PIC X(10) VALUE X'000221C317CC00000000'.
            5 PIC X(10) VALUE X'A1C2B9A0000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'F2F600F0000000000000'.
            5 PIC X(10) VALUE X'00F9F2F3000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000300000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'17C021C317D700000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000100000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000021C2A8D821C2'.
            5 PIC X(10) VALUE X'A8DC0000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000007E000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000021C313980000'.
            5 PIC X(10) VALUE X'0000223DC4A8223DC4B8'.
            5 PIC X(10) VALUE X'223DC4C1223DC658223D'.
            5 PIC X(10) VALUE X'C65E222C45D0222B34B4'.
            5 PIC X(10) VALUE X'222C45D0222C45D0222C'.
            5 PIC X(10) VALUE X'45D0102C45D021C31710'.
            5 PIC X(10) VALUE X'222C45D0222C45D0FFFF'.
            5 PIC X(10) VALUE X'FFFFFFFFFFFF222C45D0'.
            5 PIC X(10) VALUE X'222C45D0222C45D0222C'.
            5 PIC X(10) VALUE X'45D0FFFFFFFFFFFF0000'.
            5 PIC X(10) VALUE X'222C4560E0BDADD0C05F'.
            5 PIC X(10) VALUE X'A15A7B4F5B7C79000000'.
            5 PIC X(10) VALUE X'21C2CCF80000000021C3'.
            5 PIC X(10) VALUE X'1EF021C31C50AFCBAFCB'.
            5 PIC X(10) VALUE X'01000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000000021C3'.
            5 PIC X(10) VALUE X'1D2021C31D4000000000'.
            5 PIC X(10) VALUE X'21C31E1C000000000000'.
            5 PIC X(10) VALUE X'00440000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000FFFFFFFF0000'.
            5 PIC X(10) VALUE X'000021C31D8C21C31D8C'.
            5 PIC X(10) VALUE X'22296790222966982229'.
            5 PIC X(10) VALUE X'6528222965D822296418'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000002229'.
            5 PIC X(10) VALUE X'63402229626800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C23AF858FF000807FF'.
            5 PIC X(10) VALUE X'000022296B0800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000058FF0008'.
            5 PIC X(10) VALUE X'07FF0000222968F80000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000004DE2E3'.
            5 PIC X(10) VALUE X'C4D6E4E35D5D00000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000C1C6C3C20000'.
            5 PIC X(10) VALUE X'000021C31E80AFCBAFCB'.
            5 PIC X(10) VALUE X'01000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000008521C3'.
            5 PIC X(10) VALUE X'1F5021C31F7090000000'.
            5 PIC X(10) VALUE X'21C3204C0000000B0000'.
            5 PIC X(10) VALUE X'00440000000000000000'.
            5 PIC X(10) VALUE X'21C23D980000000021C3'.
            5 PIC X(10) VALUE X'1E8000000000C3C5E2C5'.
            5 PIC X(10) VALUE X'40404040FFFFFFFF0005'.
            5 PIC X(10) VALUE X'007E21C31FBC21C31FBC'.
            5 PIC X(10) VALUE X'221B1E08221B1D382247'.
            5 PIC X(10) VALUE X'30A02247338822472DC0'.
            5 PIC X(10) VALUE X'00000000000000850000'.
            5 PIC X(10) VALUE X'009D0000000000000000'.
            5 PIC X(10) VALUE X'00000085000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000040000221B'.
            5 PIC X(10) VALUE X'1C68221B1B7800000000'.
            5 PIC X(10) VALUE X'00000000000000004124'.
            5 PIC X(10) VALUE X'00002000000000000000'.
            5 PIC X(10) VALUE X'21C23AF858FF000807FF'.
            5 PIC X(10) VALUE X'0000221B205000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000058FF0008'.
            5 PIC X(10) VALUE X'07FF0000224734300000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000E3C4D8C600000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000021C335E021C33665'.
            5 PIC X(10) VALUE X'00000000C3C5E2C54040'.
            5 PIC X(10) VALUE X'40400000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000000C4C47AC3'.
            5 PIC X(10) VALUE X'C5E2C540404040000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000C1C6C3C20000'.
            5 PIC X(10) VALUE X'000021C320B0AFCBAFCB'.
            5 PIC X(10) VALUE X'01000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000E4F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F5F8E4F0F0F0F0F0F5F8'.
            5 PIC X(10) VALUE X'00002139080000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'21C24C40000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000021C200480000'.
            5 PIC X(10) VALUE X'0000A28FDEB400000000'.
            5 PIC X(10) VALUE X'22D1802021C321580004'.
            5 PIC X(10) VALUE X'180022D1804021A474B0'.
            5 PIC X(10) VALUE X'22D1800021102E5A21A4'.
            5 PIC X(10) VALUE X'7B0020893DD821C2AD70'.
            5 PIC X(10) VALUE X'21C20100A28FD028008C'.
            5 PIC X(10) VALUE X'70000000000000000000'.
            5 PIC X(10) VALUE X'0000000021C320F0008C'.
            5 PIC X(10) VALUE X'700021C2010021C2AD70'.
            5 PIC X(10) VALUE X'00000000A28FE00921C3'.
            5 PIC X(10) VALUE X'22600000000000000000'.
            5 PIC X(10) VALUE X'A1C32292000000000000'.
            5 PIC X(10) VALUE X'000000000000E4F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F6F4E4F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F6F4C8C1D5C321C29070'.
            5 PIC X(10) VALUE X'21C290700000000021C3'.
            5 PIC X(10) VALUE X'21880000000000002140'.
            5 PIC X(10) VALUE X'0000000021C321880000'.
            5 PIC X(10) VALUE X'2120D4C2D3D200002118'.
            5 PIC X(10) VALUE X'00050102FFFFFFFFA285'.
            5 PIC X(10) VALUE X'EB520000000000000000'.
            5 PIC X(10) VALUE X'21C342C0000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000000C9C7'.
            5 PIC X(10) VALUE X'E9E2D9E3C3C400000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'E2E8E2D6E4E340400000'.
            5 PIC X(10) VALUE X'0000000000000E000000'.
            5 PIC X(10) VALUE X'000000000F0000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000040'.
            5 PIC X(10) VALUE X'4400001EC8C3C9D7C4C2'.
            5 PIC X(10) VALUE X'F0F11B167F121F7A1243'.
            5 PIC X(10) VALUE X'000121C3423821C32468'.
            5 PIC X(10) VALUE X'21C322A0047400E70000'.
            5 PIC X(10) VALUE X'00F40000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000E2D8D3C4C14E4008'.
            5 PIC X(10) VALUE X'000001C8000A000A01C4'.
            5 PIC X(10) VALUE X'000A21C10DBC00000000'.
            5 PIC X(10) VALUE X'00080000047400000000'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404001C4001421C10DC6'.
            5 PIC X(10) VALUE X'00000000000800000474'.
            5 PIC X(10) VALUE X'00000000404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404001C4000A'.
            5 PIC X(10) VALUE X'21C10DDA000000000008'.
            5 PIC X(10) VALUE X'00000474000000004040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'01C4000A21C10DB20000'.
            5 PIC X(10) VALUE X'00000008000004740000'.
            5 PIC X(10) VALUE X'00004040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404001C4001421C1'.
            5 PIC X(10) VALUE X'0DE40000000000080000'.
            5 PIC X(10) VALUE X'04740000000040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404040404001C4'.
            5 PIC X(10) VALUE X'001421C10DF800000000'.
            5 PIC X(10) VALUE X'00080000047400000000'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404001C4000A21C10E0C'.
            5 PIC X(10) VALUE X'00000000000800000474'.
            5 PIC X(10) VALUE X'00000000404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404001C40014'.
            5 PIC X(10) VALUE X'21C10E16000000000008'.
            5 PIC X(10) VALUE X'00000474000000004040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'01C4003221C10E2A0000'.
            5 PIC X(10) VALUE X'00000008000004740000'.
            5 PIC X(10) VALUE X'00004040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404001C4000A21C1'.
            5 PIC X(10) VALUE X'0E5C0000000000080000'.
            5 PIC X(10) VALUE X'04740000000040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040404040E2D8'.
            5 PIC X(10) VALUE X'D3C4C14040080000003C'.
            5 PIC X(10) VALUE X'0001000101F0000421C3'.
            5 PIC X(10) VALUE X'42300000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000001'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000200000000'.
            5 PIC X(10) VALUE X'00000008000000000000'.
            5 PIC X(10) VALUE X'00100000000000000020'.
            5 PIC X(10) VALUE X'00000000938440A38182'.
            5 PIC X(10) VALUE X'9385408486888589A381'.
            5 PIC X(10) VALUE X'8240F7F1F04B00000000'.
            5 PIC X(10) VALUE X'000C0000000000000000'.
            5 PIC X(10) VALUE X'00000000404040404040'.
            5 PIC X(10) VALUE X'40400000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'C8C3D4C1C3D7F0F2F0F0'.
            5 PIC X(10) VALUE X'F0F0F0F6F44021C10DA0'.
            5 PIC X(10) VALUE X'09C4C8C3C1E9C5D9D9E2'.
            5 PIC X(10) VALUE X'00000000000000004040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404000000000'.
            5 PIC X(10) VALUE X'00004040404040404040'.
            5 PIC X(10) VALUE X'4040404040404040C8C3'.
            5 PIC X(10) VALUE X'D7F1C2C9F0F140D7D5E4'.
            5 PIC X(10) VALUE X'D47EF0F0F0F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F0F140D4D5E4D47E4040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040E2D8D3C3D6'.
            5 PIC X(10) VALUE X'C4C57E00000000000000'.
            5 PIC X(10) VALUE X'C3D6D4D4C1D9C5C17E40'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404000'.
            5 PIC X(10) VALUE X'000000000012F0F0F1C8'.
            5 PIC X(10) VALUE X'20F00000000100000000'.
            5 PIC X(10) VALUE X'E2D8D3C3C14040400000'.
            5 PIC X(10) VALUE X'00880000000000004040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040404040C4E2'.
            5 PIC X(10) VALUE X'D5404040404000000000'.
            5 PIC X(10) VALUE X'0000000000000000FFFF'.
            5 PIC X(10) VALUE X'FFFF0000000000000000'.
            5 PIC X(10) VALUE X'E6E64040404040404040'.
            5 PIC X(10) VALUE X'40F0F1F0F0F4C5D5C460'.
            5 PIC X(10) VALUE X'D4C2D3D2E4F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F6F4E4F0F0F0F0F0F6F4'.
            5 PIC X(10) VALUE X'00007F8CC3C9C3E20000'.
            5 PIC X(10) VALUE X'0012C9D5D7E30101C8C3'.
            5 PIC X(10) VALUE X'C9D7C4C2F0F1000000EF'.
            5 PIC X(10) VALUE X'C5C9C240000000550080'.
            5 PIC X(10) VALUE X'932C0120297FC8C3D4C1'.
            5 PIC X(10) VALUE X'0000064CC3D7F0F20000'.
            5 PIC X(10) VALUE X'01587EF47D0E08000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000040'.
            5 PIC X(10) VALUE X'40404040404040000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000C1000000000000'.
            5 PIC X(10) VALUE X'090E0800000700001000'.
            5 PIC X(10) VALUE X'C3D4C14000007EF4F0F1'.
            5 PIC X(10) VALUE X'C9D7C1E3F0F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F0F1F9F6F2F7'.
            5 PIC X(10) VALUE X'F8F1F1F2F3F4D9819397'.
            5 PIC X(10) VALUE X'884040404040C4C19394'.
            5 PIC X(10) VALUE X'85898481404040404040'.
            5 PIC X(10) VALUE X'404040404040F1F9F8F0'.
            5 PIC X(10) VALUE X'60F0F760F1F1F3F440D4'.
            5 PIC X(10) VALUE X'81899540E2A3998585A3'.
            5 PIC X(10) VALUE X'404040404040E3969996'.
            5 PIC X(10) VALUE X'95A39640404040404040'.
            5 PIC X(10) VALUE X'404040404040D4F5C840'.
            5 PIC X(10) VALUE X'F1E3F1404040F0F7F760'.
            5 PIC X(10) VALUE X'F1F2F360F9F9F8F74040'.
            5 PIC X(10) VALUE X'404040404040D9819397'.
            5 PIC X(10) VALUE X'88C47C8982944B839694'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404099819397'.
            5 PIC X(10) VALUE X'88844040404040404040'.
            5 PIC X(10) VALUE SPACES.
            5 PIC X(13972)  VALUE SPACES.
       01 AZ-COMPARE.
         03 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         03 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT00000007.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000009.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000000B.
            5 PIC X(20) DISPLAY VALUE 'CA-PATIENT-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000000D.
            5 PIC X(20) DISPLAY VALUE 'CA-VISIT-DATE OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'VISIT-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000000F.
            5 PIC X(20) DISPLAY VALUE 'CA-VISIT-TIME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'VISIT-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000011.
            5 PIC X(20) DISPLAY VALUE 'CA-HEART-RATE OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'VISIT-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000013.
            5 PIC X(20) DISPLAY VALUE 'CA-BLOOD-PRESSURE OF'.
            5 PIC X(20) DISPLAY VALUE ' CA-VISIT-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000015.
            5 PIC X(20) DISPLAY VALUE 'CA-MENTAL-STATE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-VISIT-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000017.
            5 PIC X(20) DISPLAY VALUE 'CA-ADDITIONAL-DATA O'.
            5 PIC X(20) DISPLAY VALUE 'F CA-VISIT-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT00000008 PIC X(6) OCCURS 2.
          3 ZUT0000000A PIC 9(2) OCCURS 2.
          3 ZUT0000000C PIC 9(10) OCCURS 2.
          3 ZUT0000000E PIC X(10) OCCURS 2.
          3 ZUT00000010 PIC X(10) OCCURS 2.
          3 ZUT00000012 PIC X(10) OCCURS 2.
          3 ZUT00000014 PIC X(10) OCCURS 2.
          3 ZUT00000016 PIC X(10) OCCURS 2.
          3 ZUT00000018 PIC X(64864) OCCURS 2.
       01 AZ-CONVERT.
         03 AZ-CONVERT-HEXIN  PIC X(1).
         03 AZ-CONVERT-HEXVAL PIC X(2).
         03 AZ-HEXSTR PIC X(16) VALUE "0123456789ABCDEF".
         03 AZ-DEC  PIC S9(4) COMP VALUE 0.
         03 FILLER REDEFINES AZ-DEC.
           05 FILLER PIC X.
           05 AZ-DECBYTE PIC X.
         03 AZ-I PIC S9(8) COMP.
         03 AZ-J PIC S9(8) COMP.
         03 AZ-Q PIC S9(8) COMP.
         03 AZ-R PIC S9(8) COMP.
         03 AZ-Q1 PIC S9(8) COMP.
         03 AZ-R1 PIC S9(8) COMP.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-ARG-LIST.
         03 ARG-LENGTH PIC 9(4) COMP-4.
         03 ARG-DATA PIC X(256).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-PATIENT-ID PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-PATIENT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-INS-CARD-NUM PIC X(10).
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-ADDRESS PIC X(20).
         5 CA-CITY PIC X(20).
         5 CA-POSTCODE PIC X(10).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(50).
         5 CA-USERID PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32302).
         3 CA-PATIENT-USER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-USERNAME PIC X(10).
         5 CA-USERPASSWORD PIC X(14).
         5 CA-ADDITIONAL-DATA PIC X(32458).
         3 CA-MEDICATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-DRUG-NAME PIC X(50).
         5 CA-STRENGTH PIC X(20).
         5 CA-AMOUNT PIC 9(03).
         5 CA-ROUTE PIC X(20).
         5 CA-FREQUENCY PIC X(20).
         5 CA-IDENTIFIER PIC X(20).
         5 CA-BIOMED-TYPE PIC X(2).
         5 CA-START-DATE PIC X(10).
         5 CA-END-DATE PIC X(10).
         5 CA-PRESCRIPTION-ID PIC 9(10).
         5 CA-ADDITIONAL-DATA PIC X(32317).
         3 CA-MEDITATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-MEDITATION-NAME PIC X(50).
         5 CA-MEDITATION-TYPE PIC X(20).
         5 CA-RELIEF PIC X(20).
         5 CA-POSTURE PIC X(20).
         5 CA-HOW-OFTEN PIC X(20).
         5 CA-ADDITIONAL-DATA PIC X(32352).
         3 CA-THRESHOLD-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-HR-THRESHOLD PIC X(10).
         5 CA-BP-THRESHOLD PIC X(10).
         5 CA-MS-THRESHOLD PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32452).
         3 CA-VISIT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-VISIT-DATE PIC X(10).
         5 CA-VISIT-TIME PIC X(10).
         5 CA-HEART-RATE PIC X(10).
         5 CA-BLOOD-PRESSURE PIC X(10).
         5 CA-MENTAL-STATE PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32432).
          5 CA-ADDITIONAL-DATA-AZ REDEFINES CA-ADDITIONAL-DATA.
          6 PIC X(32432) DISPLAY.
       PROCEDURE DIVISION USING AZ-TEST
           DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST2 STARTED...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * INITIALIZE PARAMETER
           PERFORM INITIALIZE-PARM
      * SET AREA ADDRESS TO POINTER
      * SET INPUT VALUE
           MOVE 0 TO RETURN-CODE.
      * CALL TEST PROGRAM
           DISPLAY 'CALL HCMADB02'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
           MOVE 0 TO RETURN-CODE
           IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000000 THEN
             CONTINUE
           ELSE
             MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT00000008(1)
             MOVE ZUT00000000 TO ZUT00000008(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000007
             MOVE LENGTH OF ZUT00000007 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000008(1)
             MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000008(2)
             MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
               AND (CA-RETURN-CODE OF DFHCOMMAREA = 0) THEN
             CONTINUE
           ELSE
             MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT0000000A(1)
             MOVE 0 TO ZUT0000000A(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000009
             MOVE LENGTH OF ZUT00000009 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000000A(1)
             MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000A(2)
             MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-PATIENT-ID OF DFHCOMMAREA IS NUMERIC)
               AND (CA-PATIENT-ID OF DFHCOMMAREA = 1) THEN
             CONTINUE
           ELSE
             MOVE CA-PATIENT-ID OF DFHCOMMAREA TO ZUT0000000C(1)
             MOVE 1 TO ZUT0000000C(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000B
             MOVE LENGTH OF ZUT0000000B TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000000C(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-VISIT-DATE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT00000001 THEN
             CONTINUE
           ELSE
             MOVE CA-VISIT-DATE OF CA-VISIT-REQUEST OF DFHCOMMAREA TO
           ZUT0000000E(1)
             MOVE ZUT00000001 TO ZUT0000000E(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000D
             MOVE LENGTH OF ZUT0000000D TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000000E(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-VISIT-TIME OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT00000002 THEN
             CONTINUE
           ELSE
             MOVE CA-VISIT-TIME OF CA-VISIT-REQUEST OF DFHCOMMAREA TO
           ZUT00000010(1)
             MOVE ZUT00000002 TO ZUT00000010(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000F
             MOVE LENGTH OF ZUT0000000F TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000010(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000010(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-HEART-RATE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT00000003 THEN
             CONTINUE
           ELSE
             MOVE CA-HEART-RATE OF CA-VISIT-REQUEST OF DFHCOMMAREA TO
           ZUT00000012(1)
             MOVE ZUT00000003 TO ZUT00000012(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000011
             MOVE LENGTH OF ZUT00000011 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000012(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000012(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-BLOOD-PRESSURE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT00000004 THEN
             CONTINUE
           ELSE
             MOVE CA-BLOOD-PRESSURE OF CA-VISIT-REQUEST OF DFHCOMMAREA
           TO ZUT00000014(1)
             MOVE ZUT00000004 TO ZUT00000014(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000013
             MOVE LENGTH OF ZUT00000013 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000014(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000014(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-MENTAL-STATE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT00000005 THEN
             CONTINUE
           ELSE
             MOVE CA-MENTAL-STATE OF CA-VISIT-REQUEST OF DFHCOMMAREA
           TO ZUT00000016(1)
             MOVE ZUT00000005 TO ZUT00000016(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000015
             MOVE LENGTH OF ZUT00000015 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000016(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000016(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-ADDITIONAL-DATA-AZ OF CA-VISIT-REQUEST OF DFHCOMMAREA
           = ZUT00000006 THEN
             CONTINUE
           ELSE
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32432
               MOVE CA-ADDITIONAL-DATA-AZ OF CA-VISIT-REQUEST OF
           DFHCOMMAREA(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000018(1)(AZ-J:2)
             END-PERFORM
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32432
               MOVE ZUT00000006(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000018(2)(AZ-J:2)
             END-PERFORM
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000017
             MOVE LENGTH OF ZUT00000017 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000018(1)
             MOVE 254 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000018(2)
             MOVE 254 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
      * END
           DISPLAY 'TEST_TEST2 SUCCESSFUL.'
           GOBACK.
       INITIALIZE-PARM.
           EXIT.
       CONVERT.
           MOVE AZ-CONVERT-HEXIN TO AZ-DECBYTE
           DIVIDE AZ-DEC BY 16 GIVING AZ-Q REMAINDER AZ-R
           COMPUTE AZ-Q1 = AZ-Q + 1
           COMPUTE AZ-R1 = AZ-R + 1
           MOVE AZ-HEXSTR(AZ-Q1:1) TO AZ-CONVERT-HEXVAL(1:1)
           MOVE AZ-HEXSTR(AZ-R1:1) TO AZ-CONVERT-HEXVAL(2:1)
           EXIT.
       THROW-ASSERTION.
           MOVE 1 TO MESSAGE-LEN OF BZ-ASSERT
           STRING 'COMPARE FAILED IN PROCEDURE DIVISION.'
             DELIMITED BY SIZE INTO MESSAGE-TXT OF BZ-ASSERT
             WITH POINTER MESSAGE-LEN OF BZ-ASSERT
           END-STRING
           SUBTRACT 1 FROM MESSAGE-LEN OF BZ-ASSERT
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W THE TEST "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'FAILED DUE TO AN ASSERTION.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF BZ-ASSERT(1:MESSAGE-LEN
           OF BZ-ASSERT)
           DISPLAY ' DATA ITEM NAME : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  VALUE         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  EXPECTED VALUE: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING BZ-P1 BZ-P2 BZ-P3 BZ-ASSERT
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           CALL BZUTRACE USING BZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST2.
      *+---------------------------------------------------------------+
      *| TEST_TEST3                                                    |
      *|     THIS PROGRAM IS FOR TEST TEST3                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST3'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'HCMADB02'.
       01 BZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM TEST CALLBACK'.
       01  BZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  BZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  BZ-P3 PIC X(3) VALUE 'AZU'.
       01 BZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000019.
            5 PIC X(6) DISPLAY VALUE '01AMED'.
          3 ZUT0000001A.
            5 PIC X(8) DISPLAY VALUE 'CIBALENA'.
            5 PIC X(2) DISPLAY VALUE SPACES.
          3 ZUT0000001B.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT0000001C.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT0000001D.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT0000001E.
            5 PIC X(10) DISPLAY VALUE SPACES.
          3 ZUT0000001F.
            5 PIC X(10) VALUE X'F2F0D4C7404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040F040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040F2F0F2F060'.
            5 PIC X(10) VALUE X'F1F060F2F0F2F0F2F060'.
            5 PIC X(10) VALUE X'F1F160F2F1F0F0F0F1F0'.
            5 PIC X(10) VALUE X'F0F0F7F0F64040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040C5D5C4400000'.
            5 PIC X(10) VALUE X'0000E4F0F0F0F0F1F5F2'.
            5 PIC X(10) VALUE X'0000000000000000E4F0'.
            5 PIC X(10) VALUE X'F0F0F0F1F5F240404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040C5D5C4'.
            5 PIC X(10) VALUE X'40000000000000000000'.
            5 PIC X(10) VALUE X'00000000E4F0F0F0F0F1'.
            5 PIC X(10) VALUE X'F5F24040404040404040'.
            5 PIC X(10) VALUE SPACES.
            5 PIC X(13202)  VALUE SPACES.
       01 AZ-COMPARE.
         03 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         03 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT00000020.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000022.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000024.
            5 PIC X(20) DISPLAY VALUE 'CA-PATIENT-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000026.
            5 PIC X(20) DISPLAY VALUE 'CA-VISIT-DATE OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'VISIT-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000028.
            5 PIC X(20) DISPLAY VALUE 'CA-VISIT-TIME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'VISIT-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000002A.
            5 PIC X(20) DISPLAY VALUE 'CA-HEART-RATE OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'VISIT-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000002C.
            5 PIC X(20) DISPLAY VALUE 'CA-BLOOD-PRESSURE OF'.
            5 PIC X(20) DISPLAY VALUE ' CA-VISIT-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT0000002E.
            5 PIC X(20) DISPLAY VALUE 'CA-MENTAL-STATE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-VISIT-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000030.
            5 PIC X(20) DISPLAY VALUE 'CA-ADDITIONAL-DATA O'.
            5 PIC X(20) DISPLAY VALUE 'F CA-VISIT-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT00000021 PIC X(6) OCCURS 2.
          3 ZUT00000023 PIC 9(2) OCCURS 2.
          3 ZUT00000025 PIC 9(10) OCCURS 2.
          3 ZUT00000027 PIC X(10) OCCURS 2.
          3 ZUT00000029 PIC X(10) OCCURS 2.
          3 ZUT0000002B PIC X(10) OCCURS 2.
          3 ZUT0000002D PIC X(10) OCCURS 2.
          3 ZUT0000002F PIC X(10) OCCURS 2.
          3 ZUT00000031 PIC X(64864) OCCURS 2.
       01 AZ-CONVERT.
         03 AZ-CONVERT-HEXIN  PIC X(1).
         03 AZ-CONVERT-HEXVAL PIC X(2).
         03 AZ-HEXSTR PIC X(16) VALUE "0123456789ABCDEF".
         03 AZ-DEC  PIC S9(4) COMP VALUE 0.
         03 FILLER REDEFINES AZ-DEC.
           05 FILLER PIC X.
           05 AZ-DECBYTE PIC X.
         03 AZ-I PIC S9(8) COMP.
         03 AZ-J PIC S9(8) COMP.
         03 AZ-Q PIC S9(8) COMP.
         03 AZ-R PIC S9(8) COMP.
         03 AZ-Q1 PIC S9(8) COMP.
         03 AZ-R1 PIC S9(8) COMP.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-ARG-LIST.
         03 ARG-LENGTH PIC 9(4) COMP-4.
         03 ARG-DATA PIC X(256).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-PATIENT-ID PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-PATIENT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-INS-CARD-NUM PIC X(10).
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-ADDRESS PIC X(20).
         5 CA-CITY PIC X(20).
         5 CA-POSTCODE PIC X(10).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(50).
         5 CA-USERID PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32302).
         3 CA-PATIENT-USER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-USERNAME PIC X(10).
         5 CA-USERPASSWORD PIC X(14).
         5 CA-ADDITIONAL-DATA PIC X(32458).
         3 CA-MEDICATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-DRUG-NAME PIC X(50).
         5 CA-STRENGTH PIC X(20).
         5 CA-AMOUNT PIC 9(03).
         5 CA-ROUTE PIC X(20).
         5 CA-FREQUENCY PIC X(20).
         5 CA-IDENTIFIER PIC X(20).
         5 CA-BIOMED-TYPE PIC X(2).
         5 CA-START-DATE PIC X(10).
         5 CA-END-DATE PIC X(10).
         5 CA-PRESCRIPTION-ID PIC 9(10).
         5 CA-ADDITIONAL-DATA PIC X(32317).
         3 CA-MEDITATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-MEDITATION-NAME PIC X(50).
         5 CA-MEDITATION-TYPE PIC X(20).
         5 CA-RELIEF PIC X(20).
         5 CA-POSTURE PIC X(20).
         5 CA-HOW-OFTEN PIC X(20).
         5 CA-ADDITIONAL-DATA PIC X(32352).
         3 CA-THRESHOLD-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-HR-THRESHOLD PIC X(10).
         5 CA-BP-THRESHOLD PIC X(10).
         5 CA-MS-THRESHOLD PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32452).
         3 CA-VISIT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-VISIT-DATE PIC X(10).
         5 CA-VISIT-TIME PIC X(10).
         5 CA-HEART-RATE PIC X(10).
         5 CA-BLOOD-PRESSURE PIC X(10).
         5 CA-MENTAL-STATE PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32432).
          5 CA-ADDITIONAL-DATA-AZ REDEFINES CA-ADDITIONAL-DATA.
          6 PIC X(32432) DISPLAY.
       PROCEDURE DIVISION USING AZ-TEST
           DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST3 STARTED...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * INITIALIZE PARAMETER
           PERFORM INITIALIZE-PARM
      * SET AREA ADDRESS TO POINTER
      * SET INPUT VALUE
           MOVE 0 TO RETURN-CODE.
      * CALL TEST PROGRAM
           DISPLAY 'CALL HCMADB02'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
           MOVE 0 TO RETURN-CODE
           IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000019 THEN
             CONTINUE
           ELSE
             MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT00000021(1)
             MOVE ZUT00000019 TO ZUT00000021(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000020
             MOVE LENGTH OF ZUT00000020 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000021(1)
             MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000021(2)
             MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
               AND (CA-RETURN-CODE OF DFHCOMMAREA = 0) THEN
             CONTINUE
           ELSE
             MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT00000023(1)
             MOVE 0 TO ZUT00000023(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000022
             MOVE LENGTH OF ZUT00000022 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000023(1)
             MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000023(2)
             MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-PATIENT-ID OF DFHCOMMAREA IS NUMERIC)
               AND (CA-PATIENT-ID OF DFHCOMMAREA = 2) THEN
             CONTINUE
           ELSE
             MOVE CA-PATIENT-ID OF DFHCOMMAREA TO ZUT00000025(1)
             MOVE 2 TO ZUT00000025(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000024
             MOVE LENGTH OF ZUT00000024 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000025(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000025(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-VISIT-DATE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT0000001A THEN
             CONTINUE
           ELSE
             MOVE CA-VISIT-DATE OF CA-VISIT-REQUEST OF DFHCOMMAREA TO
           ZUT00000027(1)
             MOVE ZUT0000001A TO ZUT00000027(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000026
             MOVE LENGTH OF ZUT00000026 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000027(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000027(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-VISIT-TIME OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT0000001B THEN
             CONTINUE
           ELSE
             MOVE CA-VISIT-TIME OF CA-VISIT-REQUEST OF DFHCOMMAREA TO
           ZUT00000029(1)
             MOVE ZUT0000001B TO ZUT00000029(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000028
             MOVE LENGTH OF ZUT00000028 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000029(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000029(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-HEART-RATE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT0000001C THEN
             CONTINUE
           ELSE
             MOVE CA-HEART-RATE OF CA-VISIT-REQUEST OF DFHCOMMAREA TO
           ZUT0000002B(1)
             MOVE ZUT0000001C TO ZUT0000002B(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002A
             MOVE LENGTH OF ZUT0000002A TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000002B(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000002B(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-BLOOD-PRESSURE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT0000001D THEN
             CONTINUE
           ELSE
             MOVE CA-BLOOD-PRESSURE OF CA-VISIT-REQUEST OF DFHCOMMAREA
           TO ZUT0000002D(1)
             MOVE ZUT0000001D TO ZUT0000002D(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002C
             MOVE LENGTH OF ZUT0000002C TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000002D(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000002D(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-MENTAL-STATE OF CA-VISIT-REQUEST OF DFHCOMMAREA =
           ZUT0000001E THEN
             CONTINUE
           ELSE
             MOVE CA-MENTAL-STATE OF CA-VISIT-REQUEST OF DFHCOMMAREA
           TO ZUT0000002F(1)
             MOVE ZUT0000001E TO ZUT0000002F(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002E
             MOVE LENGTH OF ZUT0000002E TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000002F(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000002F(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-ADDITIONAL-DATA-AZ OF CA-VISIT-REQUEST OF DFHCOMMAREA
           = ZUT0000001F THEN
             CONTINUE
           ELSE
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32432
               MOVE CA-ADDITIONAL-DATA-AZ OF CA-VISIT-REQUEST OF
           DFHCOMMAREA(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000031(1)(AZ-J:2)
             END-PERFORM
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32432
               MOVE ZUT0000001F(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000031(2)(AZ-J:2)
             END-PERFORM
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000030
             MOVE LENGTH OF ZUT00000030 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000031(1)
             MOVE 254 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000031(2)
             MOVE 254 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
      * END
           DISPLAY 'TEST_TEST3 SUCCESSFUL.'
           GOBACK.
       INITIALIZE-PARM.
           EXIT.
       CONVERT.
           MOVE AZ-CONVERT-HEXIN TO AZ-DECBYTE
           DIVIDE AZ-DEC BY 16 GIVING AZ-Q REMAINDER AZ-R
           COMPUTE AZ-Q1 = AZ-Q + 1
           COMPUTE AZ-R1 = AZ-R + 1
           MOVE AZ-HEXSTR(AZ-Q1:1) TO AZ-CONVERT-HEXVAL(1:1)
           MOVE AZ-HEXSTR(AZ-R1:1) TO AZ-CONVERT-HEXVAL(2:1)
           EXIT.
       THROW-ASSERTION.
           MOVE 1 TO MESSAGE-LEN OF BZ-ASSERT
           STRING 'COMPARE FAILED IN PROCEDURE DIVISION.'
             DELIMITED BY SIZE INTO MESSAGE-TXT OF BZ-ASSERT
             WITH POINTER MESSAGE-LEN OF BZ-ASSERT
           END-STRING
           SUBTRACT 1 FROM MESSAGE-LEN OF BZ-ASSERT
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W THE TEST "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'FAILED DUE TO AN ASSERTION.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF BZ-ASSERT(1:MESSAGE-LEN
           OF BZ-ASSERT)
           DISPLAY ' DATA ITEM NAME : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  VALUE         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  EXPECTED VALUE: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING BZ-P1 BZ-P2 BZ-P3 BZ-ASSERT
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           CALL BZUTRACE USING BZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST3.
      *+---------------------------------------------------------------+
      *| BZU_INIT                                                      |
      *|     INITIAL PROCEDURE                                         |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'BZU_INIT'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-TEST-NAME-LEN      PIC S9(9) COMP-5.
       01 AZ-TESTCASE-ID        PIC X(36)
           VALUE '1287988d-02c7-4393-b230-9fe7c7244205'.
       LINKAGE SECTION.
       01 AZ-TEST               PIC X(80).
       01 AZ-TEST-ID            PIC X(80).
       PROCEDURE DIVISION USING AZ-TEST AZ-TEST-ID.
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           DISPLAY 'BZU_INIT : ' AZ-TEST(1:AZ-TEST-NAME-LEN)
           MOVE AZ-TESTCASE-ID TO AZ-TEST-ID
           GOBACK.
       END PROGRAM BZU_INIT.
      *+---------------------------------------------------------------+
      *| BZU_TERM                                                      |
      *|     TERMINATION PROCEDURE                                     |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'BZU_TERM'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-TEST-NAME-LEN      PIC S9(9) COMP-5.
       LINKAGE SECTION.
       01 AZ-TEST               PIC X(80).
       PROCEDURE DIVISION USING AZ-TEST.
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           DISPLAY 'BZU_TERM : ' AZ-TEST(1:AZ-TEST-NAME-LEN)
           GOBACK.
       END PROGRAM BZU_TERM.
      *+---------------------------------------------------------------+
      *| EVALOPT                                                       |
      *|   FUNCTION TO EVALUATE THAT THE BIT OF OPTION DATA            |
      *|   (1) TAKE AND OF GROUP COMMON MASK AND OPTION IN ARG0        |
      *|   (2) CHECK IF THE GROUP MASK IS EQUAL TO (1)                 |
      *|       IF EQUAL,    RTN01 IS 0                                 |
      *|       IF NO EQUAL, RTN01 IS 1                                 |
      *+---------------------------------------------------------------+
       ID DIVISION.
       PROGRAM-ID. EVALOPT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  OUT1-REC.
         05 OUT1-DATA                PIC X(1) OCCURS 8.
       01 OUT1-DATA-R REDEFINES OUT1-REC.
         05 OUT1-DATA-UP             PIC X(4).
         05 OUT1-DATA-DOWN           PIC X(4).
       01  OUT2-REC.
         05  OUT2-DATA               PIC X(1) OCCURS 8.
       01  OUT2-DATA-R REDEFINES OUT2-REC.
         05 OUT2-DATA-UP             PIC X(4).
         05 OUT2-DATA-DOWN           PIC X(4).
       01  WORK1-REC.
         05  WORK1-DATA              PIC X(1) OCCURS 8.
       01  WORK1-DATA-R REDEFINES WORK1-REC.
         05 WORK1-DATA-UP            PIC X(4).
         05 WORK1-DATA-DOWN          PIC X(4).
       01  WORK-AREA.
         05  WORK-HEX-UP             PIC 9(4)  COMP.
         05  WORK-HEX-DOWN           PIC 9(4)  COMP.
       01  HEX-CHG-BEF.
         05  HEX-CHANGE-LV           PIC X(1) VALUE LOW-VALUE.
         05  HEX-CHANGE-BEFORE       PIC X(1).
       01  HEX-CHG-AFT      REDEFINES  HEX-CHG-BEF.
         05  HEX-CHANGE-AFTER        PIC 9(4)  COMP.
       01  TBL-CHANGE-DATA.
          05  FILLER                 PIC  X(004) VALUE '0000'.
          05  FILLER                 PIC  X(001) VALUE '0'.
          05  FILLER                 PIC  X(004) VALUE '0001'.
          05  FILLER                 PIC  X(001) VALUE '1'.
          05  FILLER                 PIC  X(004) VALUE '0010'.
          05  FILLER                 PIC  X(001) VALUE '2'.
          05  FILLER                 PIC  X(004) VALUE '0011'.
          05  FILLER                 PIC  X(001) VALUE '3'.
          05  FILLER                 PIC  X(004) VALUE '0100'.
          05  FILLER                 PIC  X(001) VALUE '4'.
          05  FILLER                 PIC  X(004) VALUE '0101'.
          05  FILLER                 PIC  X(001) VALUE '5'.
          05  FILLER                 PIC  X(004) VALUE '0110'.
          05  FILLER                 PIC  X(001) VALUE '6'.
          05  FILLER                 PIC  X(004) VALUE '0111'.
          05  FILLER                 PIC  X(001) VALUE '7'.
          05  FILLER                 PIC  X(004) VALUE '1000'.
          05  FILLER                 PIC  X(001) VALUE '8'.
          05  FILLER                 PIC  X(004) VALUE '1001'.
          05  FILLER                 PIC  X(001) VALUE '9'.
          05  FILLER                 PIC  X(004) VALUE '1010'.
          05  FILLER                 PIC  X(001) VALUE 'A'.
          05  FILLER                 PIC  X(004) VALUE '1011'.
          05  FILLER                 PIC  X(001) VALUE 'B'.
          05  FILLER                 PIC  X(004) VALUE '1100'.
          05  FILLER                 PIC  X(001) VALUE 'C'.
          05  FILLER                 PIC  X(004) VALUE '1101'.
          05  FILLER                 PIC  X(001) VALUE 'D'.
          05  FILLER                 PIC  X(004) VALUE '1110'.
          05  FILLER                 PIC  X(001) VALUE 'E'.
          05  FILLER                 PIC  X(004) VALUE '1111'.
          05  FILLER                 PIC  X(001) VALUE 'F'.
          01  TBL-DATA REDEFINES TBL-CHANGE-DATA.
           05  TBL-CHG  OCCURS  16 TIMES.
             10  TBL-BIT-CHAR        PIC  X(004).
             10  TBL-HEX-CHAR        PIC  X(001).
       01 BIT-COUNT                  PIC 9(1).
       01 I                          PIC S9(8) COMP.
       LINKAGE SECTION.
       01 G-MASK.
         03 D-G-MASK                 PIC X(1) OCCURS 19.
       01 COM-MASK.
         03 D-COM-MASK               PIC X(1) OCCURS 19.
       01 O-ARG0.
         03 D-O-ARG0                 PIC X(1) OCCURS 19.
       01 BYTE-COUNT                 PIC S9(8) COMP.
       01 RTN01                      PIC 9(1).
       PROCEDURE DIVISION USING G-MASK COM-MASK O-ARG0 BYTE-COUNT
            RTN01.
            MOVE 0 TO RTN01
            PERFORM VARYING I FROM 1 BY 1 UNTIL I > BYTE-COUNT
              PERFORM ANDCOMMASK
              IF RTN01 = 1 THEN
                GOBACK
              END-IF
            END-PERFORM.
            EXIT PROGRAM.
       ANDCOMMASK.
      * CONVERT GROUP COMMON MASK TO BIT
            MOVE D-COM-MASK(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT1-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT1-DATA-DOWN.
      * CONVERT OPTION IN ARG0 TO BIT
            MOVE D-O-ARG0(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT2-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT2-DATA-DOWN.
      * CREATE EVAL BIT FROM GROUP COMMON MASK BIT AND ARG0 BIT
            PERFORM VARYING BIT-COUNT FROM 1 BY 1 UNTIL BIT-COUNT > 8
              IF OUT1-DATA(BIT-COUNT) = '1' AND
                 OUT2-DATA(BIT-COUNT) = '1' THEN
                MOVE '1' TO WORK1-DATA(BIT-COUNT)
              ELSE
                MOVE '0' TO WORK1-DATA(BIT-COUNT)
              END-IF
            END-PERFORM.
      * CONVERT GROUP MASK TO BIT DATA
            MOVE D-G-MASK(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT1-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT1-DATA-DOWN.
      * CHECK IF EQUAL BETWEEN EVAL BIT AND GROUP MASK BIT
            IF WORK1-DATA-UP = OUT1-DATA-UP AND
               WORK1-DATA-DOWN = OUT1-DATA-DOWN THEN
              CONTINUE
            ELSE
              MOVE 1 TO RTN01
            END-IF
            EXIT.
       END PROGRAM 'EVALOPT'.
      *+---------------------------------------------------------------+
      *| AZU_GENERIC_CICS                                              |
      *|   GENERIC CICS CALLBACK EXIT POINT                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'AZU_GENERIC_CICS'.
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * CICS_INPT.
           ENTRY 'CICS_INPT'.
           DISPLAY 'CICS_INPT ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_OUTP.
           ENTRY 'CICS_OUTP'.
           DISPLAY 'CICS_OUTP ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_INPT_0E08 FOR RETURN.
           ENTRY 'CICS_INPT_0E08'.
           DISPLAY 'CICS_INPT_0E08 ...'
           MOVE 0 TO RETURN-CODE.
           GOBACK.
       END PROGRAM 'AZU_GENERIC_CICS'.
      *+---------------------------------------------------------------+
      *| AZU_GENERIC_DB2                                               |
      *|   GENERIC DB2 CALLBACK EXIT POINT                             |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'AZU_GENERIC_DB2'.
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * DB2_INPT.
           ENTRY 'DB2_INPT'.
           DISPLAY 'DB2_INPT ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * DB2_OUTP.
           ENTRY 'DB2_OUTP'.
           DISPLAY 'DB2_OUTP ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
       END PROGRAM 'AZU_GENERIC_DB2'.
      *+---------------------------------------------------------------+
      *| PROGRAM FOR EXEC CICS RETURN                                  |
      *|    FUNCTION CODE: 0E08                                        |
      *|                                                               |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'CICS_0E08_HCMADB02'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  BZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  BZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  BZ-P3 PIC X(3) VALUE 'AZU'.
       01 BZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 AZ-TEST-LEN       PIC S9(8) COMP.
       01 AZ-RECORD.
         03 AZ-RECORD-COUNT-OT OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
         03 AZ-RECORD-COUNT-IN OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
       01 AZ-RECORD-PTR POINTER.
       01 AZ-RECORD-PTR-VALUE REDEFINES
            AZ-RECORD-PTR PIC S9(9) COMP-5.
       01 AZ-OPT-MASK-DATA2  PIC X(2).
       01 AZ-OPT-MASK-DATA9  PIC X(9).
       01 AZ-OPT-MASK-DATA11 PIC X(11).
       01 AZ-OPT-MASK-DATA19 PIC X(19).
       01 AZ-OPT-BYTECOUNT   PIC S9(8) COMP.
       01 AZ-OPT-RC          PIC 9(1) VALUE 0.
       01 AZ-OPT-COMMASK.
         03  AZ-OPT-COMMASK-DATA2  PIC X(2) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA9  PIC X(9) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA11 PIC X(11) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA19 PIC X(19) OCCURS 1.
       01 AZ-LINE-BYTE      PIC S9(2) COMP.
       01 AZ-LINE-NUM       PIC 9(5).
       01 AZ-LINE-NUM-R   REDEFINES AZ-LINE-NUM.
         03 AZ-LINE-NUM-RD  PIC 9(1) OCCURS 5.
       01 AZ-LINE-I         PIC S9(8) COMP.
       01 AZ-LINE-J         PIC S9(8) COMP.
       LOCAL-STORAGE SECTION.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-INFO-BLOCK.
          COPY BZUITERC.
       01 AZ-WK-RECORD-COUNT PIC 9(5) COMP-5 VALUE 0.
       01 AZ-MODX                   PIC X(4).
       01 AZ-DFHEIBLK.
         03 FILLER                  PIC X(85).
       01 AZ-DFHCOMMAREA.
         03 FILLER                  PIC X(1).
       01 ARG0.
         03 ARG0-1        PIC X(2).
         03 ARG0-A        PIC X(28).
         03 ARG0-B REDEFINES ARG0-A.
           05 ARG0-2      PIC X(9).
           05 FILLER      PIC X(19).
         03 ARG0-C REDEFINES ARG0-A.
           05 FILLER      PIC X(6).
           05 ARG0-D.
             07 ARG0-3    PIC 9(1) OCCURS 22.
       01 ARG1            POINTER.
       01 ARG2            POINTER.
       01 ARG3            POINTER.
       01 ARG4            POINTER.
       01 ARG5            POINTER.
       01 ARG6            POINTER.
       01 ARG7            POINTER.
       01 ARG8            POINTER.
       01 ARG9            POINTER.
       01 ARG10           POINTER.
       01 AZ-CICS-TARGET-NAME-DEF4 PIC X(4).
       01 AZ-CICS-TARGET-NAME-DEF7 PIC X(7).
       01 AZ-CICS-TARGET-NAME-DEF8 PIC X(8).
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * CICS_INPT_0E08_HCMADB02.
           ENTRY 'CICS_INPT_0E08_HCMADB02' USING AZ-TEST
           AZ-INFO-BLOCK AZ-DFHEIBLK AZ-DFHCOMMAREA ARG0 ARG1 ARG2
           ARG3 ARG4 ARG5 ARG6 ARG7 ARG8 ARG9 ARG10.
           DISPLAY 'CICS_0E08_HCMADB02 CHECK VALUES...'
           MOVE 4 TO RETURN-CODE.
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * SET GROUP OPTION COMMON MASK IN CICS GROUP
           MOVE X'0000' TO AZ-OPT-COMMASK-DATA2(1).
      * EXEC CICS RETURN X'0000'
           IF ARG0-1 = X'0E08'
             MOVE X'0000' TO AZ-OPT-MASK-DATA2
             MOVE 2 TO AZ-OPT-BYTECOUNT
             CALL 'EVALOPT' USING AZ-OPT-MASK-DATA2
               AZ-OPT-COMMASK-DATA2(1) ARG0-2
               AZ-OPT-BYTECOUNT AZ-OPT-RC
             IF AZ-OPT-RC = 0 THEN
               MOVE 3 TO AZ-LINE-BYTE
               PERFORM GETLINENUM
               DISPLAY 'EXEC CICS RETURN X''0000'''
                ' L=' AZ-LINE-NUM
               MOVE ITER OF AZ-INFO-BLOCK TO AZ-RECORD-COUNT-OT(1)
               EVALUATE AZ-TEST(1:AZ-TEST-LEN)
                 WHEN SPACE
                   CONTINUE
                 WHEN 'TEST2'
                   PERFORM O0E080-TEST2
                   CONTINUE
                 WHEN 'TEST3'
                   PERFORM O0E080-TEST3
                   CONTINUE
                 WHEN OTHER
                   CONTINUE
                 END-EVALUATE
             END-IF
           END-IF.
           PERFORM TEARDOWN.
      * SET INPUT VALUE
      * CICS_OUTP_0E08_HCMADB02.
           ENTRY 'CICS_OUTP_0E08_HCMADB02' USING AZ-TEST
           AZ-INFO-BLOCK AZ-DFHEIBLK AZ-DFHCOMMAREA ARG0 ARG1 ARG2
           ARG3 ARG4 ARG5 ARG6 ARG7 ARG8 ARG9 ARG10.
           DISPLAY 'CICS_0E08_HCMADB02 INPUT VALUES...'
           MOVE 0 TO RETURN-CODE.
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * SET GROUP OPTION COMMON MASK IN CICS GROUP
           MOVE X'0000' TO AZ-OPT-COMMASK-DATA2(1).
      * EXEC CICS RETURN X'0000'
           IF ARG0-1 = X'0E08'
             MOVE X'0000' TO AZ-OPT-MASK-DATA2
             MOVE 2 TO AZ-OPT-BYTECOUNT
             CALL 'EVALOPT' USING AZ-OPT-MASK-DATA2
               AZ-OPT-COMMASK-DATA2(1) ARG0-2
               AZ-OPT-BYTECOUNT AZ-OPT-RC
             IF AZ-OPT-RC = 0 THEN
               MOVE 3 TO AZ-LINE-BYTE
               PERFORM GETLINENUM
               DISPLAY 'EXEC CICS RETURN X''0000'''
                ' L=' AZ-LINE-NUM
               MOVE ITER OF AZ-INFO-BLOCK TO AZ-RECORD-COUNT-IN(1)
               EVALUATE AZ-TEST(1:AZ-TEST-LEN)
                 WHEN SPACE
                   CONTINUE
                 WHEN 'TEST2'
                   CONTINUE
                 WHEN 'TEST3'
                   CONTINUE
                 WHEN OTHER
                   CONTINUE
                 END-EVALUATE
             END-IF
           END-IF.
           PERFORM TEARDOWN.
       O0E080-TEST2.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       O0E080-TEST3.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       GETLINENUM.
           MOVE 1 TO AZ-LINE-J
           PERFORM VARYING AZ-LINE-I FROM AZ-LINE-BYTE BY 1
             UNTIL AZ-LINE-I > AZ-LINE-BYTE + 5
             MOVE ARG0-3(AZ-LINE-I) TO AZ-LINE-NUM-RD(AZ-LINE-J)
             ADD 1 TO AZ-LINE-J
           END-PERFORM
           EXIT.
       TEARDOWN.
           DISPLAY 'CICS_0E08_HCMADB02 SUCCESSFUL.'
           GOBACK.
       END PROGRAM 'CICS_0E08_HCMADB02'.
